# Manipulating DataFrames

In [24]:
import pandas as pd

data = {'first': ['Carl', 'Francis', 'Sam'],
        'last':  ['Po', 'Nguyen', 'Smith'],
        'age':   ['32', '45', '22']}
data

{'first': ['Carl', 'Francis', 'Sam'],
 'last': ['Po', 'Nguyen', 'Smith'],
 'age': ['32', '45', '22']}

In [25]:
clients = pd.DataFrame(data)
clients

     first    last age
0     Carl      Po  32
1  Francis  Nguyen  45
2      Sam   Smith  22

In [26]:
print(clients)

     first    last age
0     Carl      Po  32
1  Francis  Nguyen  45
2      Sam   Smith  22

# Renaming

In [27]:
clients.rename(columns={'first':'First Name'})

  First Name    last age
0       Carl      Po  32
1    Francis  Nguyen  45
2        Sam   Smith  22

In [28]:
clients.rename(index={0:'a', 1:'b', 2:'c'}, inplace= True) ##inplace apply the change to clients dataframe

In [29]:
clients

     first    last age
a     Carl      Po  32
b  Francis  Nguyen  45
c      Sam   Smith  22

In [30]:
clients.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   3 non-null      object
 1   last    3 non-null      object
 2   age     3 non-null      object
dtypes: object(3)
memory usage: 96.0+ bytes

In [31]:
clients.reset_index(inplace=True)

In [32]:
clients

  index    first    last age
0     a     Carl      Po  32
1     b  Francis  Nguyen  45
2     c      Sam   Smith  22

## Dropping

In [33]:
clients.columns
print(clients.columns)

Index(['index', 'first', 'last', 'age'], dtype='object')

In [34]:

clients.drop(columns='first')

  index    last age
0     a      Po  32
1     b  Nguyen  45
2     c   Smith  22

In [35]:
clients.drop(index=0)

  index    first    last age
1     b  Francis  Nguyen  45
2     c      Sam   Smith  22

Set Type

In [36]:
clients.age

0    32
1    45
2    22
Name: age, dtype: object

In [37]:
clients.age.astype(int)

0    32
1    45
2    22
Name: age, dtype: int64